//==============================================================================================
/// File Name	: SoundFadeController.cs
/// Summary		: 音声にフェード処理を追加する
//==============================================================================================
using UnityEngine;
//==============================================================================================
public class SoundFadeController : MonoBehaviour
{
    //------------------------------------------------------------------------------------------
    // member variable
    //------------------------------------------------------------------------------------------
    //オーディオソース
    private static AudioSource audioSource;
    //フェードスピード
    private static float fadeSpeed;



    //------------------------------------------------------------------------------------------
    // summary : Start
    // remarks : none
    // param   : none
    // return  : none
    //------------------------------------------------------------------------------------------
    private void Start()
    {
        // 初期化処理
        Init();
    }



    //------------------------------------------------------------------------------------------
    // summary : Update
    // remarks : none
    // param   : none
    // return  : none
    //------------------------------------------------------------------------------------------
    private void Update()
    {
        //ボリュームの限界になったらフェードを切る
        FadeSpeedReset();
        //ボリュームをフェードスピード分足していく
        audioSource.volume += fadeSpeed;
    }



    //------------------------------------------------------------------------------------------
    // summary : フェードの限界に達したら停止する
    // remarks : none
    // param   : none
    // return  : none
    //------------------------------------------------------------------------------------------
    private void FadeSpeedReset()
    {
        //フェードインしている時
        if (fadeSpeed > 0)
        {
            //1.0になったら
            if (audioSource.volume >= 1.0f)
            {
                //フェードスピードを0にする
                fadeSpeed = 0.0f;
            }
        }
        //フェードアウトしている時
        else if (fadeSpeed < 0)
        {
            //0.0になったら
            if (audioSource.volume <= 0.0f)
            {
                //フェードスピードを0にする
                fadeSpeed = 0.0f;
            }
        }
    }



    //------------------------------------------------------------------------------------------
    // summary : フェードインのスピードを設定する
    // remarks : none
    // param   : float
    // return  : none
    //------------------------------------------------------------------------------------------
    public static void SetFadeInSpeed(float speed)
    {
        //必ずプラスにする
        fadeSpeed = 1.0f * Mathf.Abs(speed);
    }



    //------------------------------------------------------------------------------------------
    // summary : フェードアウトのスピードを設定する
    // remarks : none
    // param   : float
    // return  : none
    //------------------------------------------------------------------------------------------
    public static void SetFadeOutSpeed(float speed)
    {
        //必ずマイナスにする
        fadeSpeed = -1.0f * Mathf.Abs(speed);
    }



    //------------------------------------------------------------------------------------------
    // summary : フェード行わない
    // remarks : none
    // param   : none
    // return  : none
    //------------------------------------------------------------------------------------------
    public static void NotSoundFade()
    {
        //フェードスピードを0にする
        fadeSpeed = 0.0f;
    }



    //------------------------------------------------------------------------------------------
    // summary : フェード完了を検知する
    // remarks : none
    // param   : none
    // return  : none
    //------------------------------------------------------------------------------------------
    public static AudioSource GetAudioSource()
    {
        return audioSource;
    }



    //------------------------------------------------------------------------------------------
    // summary : 初期化処理
    // remarks : none
    // param   : none
    // return  : none
    //------------------------------------------------------------------------------------------
    private void Init()
    {
        audioSource = GetComponent<AudioSource>();
        fadeSpeed = 0.0f;
    }
}
