//==============================================================================================
/// File Name	: SceneEffecterController.cs
/// Summary		: シーンエフェクト
//==============================================================================================
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using System;
using Common;
//==============================================================================================
public class SceneEffecterController : MonoBehaviour
{
    //------------------------------------------------------------------------------------------
    // member variable
    //------------------------------------------------------------------------------------------
    // シングルトンのための実体
    private static SceneEffecterController _instance = null;
    public static SceneEffecterController instance
    {
        get { return _instance ?? (_instance = FindObjectOfType<SceneEffecterController>()); }
        private set { _instance = value; }
    }

    [SerializeField]
    private BubbleFadeFX bubbleFadeFX;  // バブルフェードエフェクト

    //------------------------------------------------------------------------------------------
    // Awake
    //------------------------------------------------------------------------------------------
    private void Awake()
    {
        // 自身がインスタンスでなければ自滅
        if (this != instance)
        {
            Destroy(gameObject);
            return;
        }

        // 以降破棄しない
        DontDestroyOnLoad(gameObject);
    }

	//------------------------------------------------------------------------------------------
    // Start
	//------------------------------------------------------------------------------------------
    private void Start()
    {
        
    }

	//------------------------------------------------------------------------------------------
    // Update
	//------------------------------------------------------------------------------------------
	private void Update()
    {
        
    }

    //------------------------------------------------------------------------------------------
    // OnDestroy
    //------------------------------------------------------------------------------------------
    private void OnDestroy()
    {
        // 自身がインスタンスなら登録を解除
        if (this == instance) _instance = null;
    }

    //------------------------------------------------------------------------------------------
    // エフェクトの開始
    //------------------------------------------------------------------------------------------
    public static void StartEffect()
    {
        instance.bubbleFadeFX.Play();
    }

}
