//==============================================================================================
/// File Name	: DebugLogger.cs
/// Summary		: ビルド時にDebug.Logが呼び出されないようにする
//==============================================================================================
using System.Diagnostics;
//==============================================================================================
public static class DebugLogger
{
    //------------------------------------------------------------------------------------------
    // summary : Conditional属性を用いてUNITY_EDITOR時のみ実行を許可する
    // remarks : none
    // param   : object
    // return  : none
    //------------------------------------------------------------------------------------------
    [Conditional("UNITY_EDITOR")]
    public static void Log(object o)
    {
        UnityEngine.Debug.Log(o);
    }
}
