//==============================================================================================
/// File Name	: GameInformation.cs
/// Summary		: 公開年、コピーライト表示
//==============================================================================================
using UnityEngine;
using UnityEngine.UI;
//==============================================================================================
public class GameInformation : MonoBehaviour
{
    //------------------------------------------------------------------------------------------
    // member variable
    //------------------------------------------------------------------------------------------
    // コピーライト用テキスト
    [SerializeField]
    private Text copyright = null;



	//------------------------------------------------------------------------------------------
    // Start
	//------------------------------------------------------------------------------------------
    private void Start()
    {
        // バージョン
        var version = Application.version;
        // リリース
        var companyName = Application.companyName;
        // テキストに挿入
        copyright.text = $"Ver.{version} © 2020 {companyName}";
    }
}
